:PROPERTIES:
- org-mode configuration
#+TITLE:   First tier C26:0-LPC Population Distribution Analysis 
#+AUTHOR:    Brittany Wong, Nate McIntosh, Matthew Henderson
#+DATE:      \today
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+DRAWERS: LOGBOOK CLOCK HIDDEN PROPERTIES
#+STARTUP: overview
#+bibliography: Exported Items.bib
#+cite_export: csl 
#+Latex_class: koma-article
#+LaTeX_header: \usepackage{textpos}
#+LaTeX_header: \usepackage[final]{draftwatermark}
#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage[automark, autooneside=false, headsepline]{scrlayer-scrpage}
#+LaTeX_HEADER: \clearpairofpagestyles
#+LaTeX_HEADER: \ihead{\leftmark}% section on the inner (oneside: right) side
#+LaTeX_HEADER: \ohead{\rightmark}% subsection on the outer (oneside: left) side
#+LaTeX_HEADER: \ofoot*{\pagemark}% the pagenumber on the outer side of the foot, also on plain pages
#+LaTeX_HEADER: \pagestyle{scrheadings}

:END:

* Data review

#+begin_src R :session *R* :results output :exports results :tangle yes
     library("tidyverse")
     library("readxl")
     library("mcr")
     ##library("zoo")
     ##library("VCA")
     ## library("xtable")
     library("stargazer")
     library("DBI")
     library("RMariaDB")

   today <- as.Date(now())
   start  <- '2025-03-21' ## start of pilot data collection
   d7 <- today - 7 ## used to filter data for weekly review
   d30 <- today - 30 ## used for 30 day rolling population based thresholds
   d60 <- today - 60 
  `%nin%` <- Negate(`%in%`)

  with_con <- function(query, params){
	 con <- dbConnect(
	   drv = RMariaDB::MariaDB(),
	   dbname = "sm",
	   username = "mpah",
	   password = "smjh13oo", 
	   host = "localhost", 
	   port = 3306,
	   mysql = TRUE
	 )
	 request  <- dbSendQuery(con, query, params = params)
	 data <- dbFetch(request)
	 dbDisconnect(con)
	 colnames(data) <- tolower(colnames(data))
	 data
       }



     params = list(start) ## first run removed, very different results pre maintainance!!
     ## first tier results
     sm1st_query <- "SELECT DATE(createdate) AS date, instrument, plate, well, sample, result FROM sm1st
			 WHERE analyte = 'ASA' AND
			 sampletype = 'OBS' AND
			 sample like 'N%' AND
			 createdate >= ?"

     #asa <- with_con(sm1st_query, params)
  asa <- read.csv(file = "../data/asa_data.csv")

  ## %>%
  ##   filter(analyte == "ASA")



   absdiff <- function(l){
     abs(first(l)-last(l))
   }

   diff <- function(l){
     first(l)-last(l)
   }

   densarea <- function(dens, lower, upper) {
     xx <- dens$x
     yy <- dens$y
     dx <- xx[2L] - xx[1L]
     C <- sum(yy) * dx ## total area should be 1
     p.unscaled <- sum(yy[xx >= lower & xx <= upper]) * dx
     round(p.unscaled/C, digits = 5) ## scaled probablity
   } 


#+end_src

#+RESULTS:

** SM1ST

#+begin_src R :session *R* :results output graphics file :file ../figures/asadensity_filter.pdf :exports results :tangle yes
  asa %>%
      filter(plate != "SM1ST2025010105" & sample != "N20250515-0122") %>%
       ggplot() +
      geom_density(aes(x = result, fill = plate), alpha = 0.4) +
    geom_vline(xintercept = 15, colour = "red", linetype = "dashed") +
    geom_vline(xintercept = 0.77, colour = "red", linetype = "dashed") +
    guides(fill = "none") +
      ##coord_cartesian(xlim = c(0, 200)) +
      ylab("Density") +
      xlab("uM")
#+end_src

#+CAPTION[]: ASA probability density by plate (plate SM1ST2025010105 and sample N20250515-0122 removed)
#+NAME: fig:c26density
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/asadensity_filter.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/asalate.pdf :exports results :tangle yes
  asa %>%
    filter(plate != "SM1ST2025010105" & sample != "N20250515-0122") %>%
    group_by(instrument, plate) %>%
    summarize(mean = mean(result, na.rm = TRUE),
	      median = median(result, na.rm = TRUE)) %>%
    gather(key = center , value = value , mean:median) %>%
    ggplot(aes(x = plate)) +
    geom_point(aes(y = value, colour = center, shape = instrument)) +
    geom_hline(yintercept = 0.32, colour = "red", linetype = "dashed") +
    geom_hline(yintercept = 0.77, colour = "red", linetype = "dashed") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
    ylab("uM") +
    xlab("Plate")
#+end_src

#+CAPTION[]: Cummulative Plate review (plate SM1ST2025010105 and sample N20250515-0122 removed)
#+NAME: fig:c26plate
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/asalate.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/weekasalate.pdf :exports results :tangle yes
  asa %>%
    filter(date >= d60 ) %>%
    group_by(instrument, plate) %>%
    summarize(mean = mean(result, na.rm = TRUE),
	      median = median(result, na.rm = TRUE)) %>%
    gather(key = center , value = value , mean:median) %>%
    ggplot(aes(x = plate)) +
    geom_point(aes(y = value, colour = center, shape = instrument)) +
    geom_hline(yintercept = 0.32, colour = "red", linetype = "dashed") +
    geom_hline(yintercept = 0.77, colour = "red", linetype = "dashed") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
    ylab("uM") +
    xlab("Plate")
#+end_src

#+CAPTION[]: Weekly plate review all plates included
#+NAME: fig:c26plate
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/weekasalate.pdf]]


#+begin_src R :session *R* :results output latex :exports results :tangle yes
 asa %>%
    filter(date >= d60 ) %>%
    group_by(day = floor_date(date, unit = "day")) %>%
    summarize(mean = mean(result, na.rm = TRUE),
	      median = median(result, na.rm = TRUE),
	      p98 = quantile(result, probs = 0.98, type = 8)) %>%
    as.data.frame() %>%
    stargazer(summary = FALSE, title = "Daily Mean and Median C26:0-LPC results")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Fri, Sep 19, 2025 - 04:08:42 PM
\begin{table}[!htbp] \centering 
  \caption{Daily Mean and Median C26:0-LPC results} 
  \label{} 
\begin{tabular}{@{\extracolsep{5pt}} ccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
 & day & mean & median & p98 \\ 
\hline \\[-1.8ex] 
1 & 2025-07-21 & $5.636$ & $5.500$ & $8.778$ \\ 
2 & 2025-07-23 & $6.471$ & $6.150$ & $12.690$ \\ 
3 & 2025-07-24 & $6.832$ & $5.850$ & $14.128$ \\ 
4 & 2025-07-25 & $5.912$ & $5.800$ & $9.736$ \\ 
5 & 2025-07-29 & $5.264$ & $5.100$ & $9.500$ \\ 
6 & 2025-07-30 & $4.911$ & $4.700$ & $8.334$ \\ 
7 & 2025-08-07 & $6.016$ & $5.850$ & $11.990$ \\ 
8 & 2025-08-08 & $5.250$ & $4.700$ & $12.800$ \\ 
9 & 2025-08-12 & $5.672$ & $5.400$ & $9.800$ \\ 
10 & 2025-08-19 & $4.844$ & $4.700$ & $7.680$ \\ 
11 & 2025-08-20 & $5.112$ & $4.900$ & $8.828$ \\ 
12 & 2025-08-26 & $4.889$ & $4.800$ & $8.478$ \\ 
13 & 2025-08-27 & $4.700$ & $4.500$ & $7.800$ \\ 
14 & 2025-09-02 & $5.998$ & $5.800$ & $11.412$ \\ 
15 & 2025-09-04 & $12.397$ & $11.600$ & $24.240$ \\ 
16 & 2025-09-09 & $8.471$ & $8.050$ & $14.178$ \\ 
17 & 2025-09-10 & $6.973$ & $6.700$ & $13.278$ \\ 
18 & 2025-09-17 & $6.971$ & $6.600$ & $14.190$ \\ 
19 & 2025-09-18 & $5.797$ & $5.600$ & $9.600$ \\ 
20 & 2025-09-19 & $4.811$ & $4.600$ & $6.500$ \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export

#+begin_src R :session *R* :results output graphics file :file ../figures/asaplate_day.pdf :exports results :tangle yes
  asa %>%
    filter(plate != "SM1ST2025010105") %>%
    group_by(instrument, day = floor_date(date, unit = "day")) %>%
    summarize(mean = mean(result, na.rm = TRUE),
	      median = median(result, na.rm = TRUE)) %>%
    gather(key = center , value = value , mean:median) %>%
    ggplot(aes(x = day)) +
    geom_point(aes(y = value, colour = center, shape = instrument)) +
    geom_hline(yintercept = 0.3, colour = "red", linetype = "dashed") +
    geom_hline(yintercept = 0.72, colour = "red", linetype = "dashed") +
    geom_hline(yintercept = 0.49, colour = "#F8766D", linetype = "dashed") +
    geom_hline(yintercept = 0.48, colour = "#00BFC4", linetype = "dashed") +
    scale_x_date(date_labels = "%d-%b") +
    ylab("uM") +
    xlab("Day")
#+end_src
#+CAPTION[]: Daily Means and Medians (SM1ST2025010105 removed)
#+NAME: fig:asawell
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/asaplate_day.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/asawell.pdf :exports results :tangle yes
  asa %>%
    filter(date >= d30 ) %>%
    ggplot(aes(x = well, y = result, group = plate, colour = plate, shape = instrument)) +
    geom_point() +
    geom_line() +
    geom_hline(yintercept = 15, colour = "red", linetype = "dashed") +
    ##  facet_grid(rows = vars(instrument), col = vars(date), )
    facet_grid(rows = vars(date), scales = "free_y") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) 
#+end_src
#+CAPTION[]: Weekly plate review by well
#+NAME: fig:asawell
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/asawell.pdf]]



#+begin_src R :session *R* :results output graphics file :file ../figures/asadaily.pdf :exports results :tangle yes
  asa %>%
    group_by(day = floor_date(date, unit = "day")) %>%
    summarize(mean = mean(result, na.rm = TRUE),
	      median = median(result, na.rm = TRUE)) %>%
    gather(key = center , value = value , mean:median) %>%
    ggplot(aes(x = day)) +
    geom_line(aes(y = value, colour = center)) +
    scale_x_date(date_labels = "%d-%b") +
    ylab("uM") +
    xlab("Day")
#+end_src
#+CAPTION[]: Daily plate review all plates included
#+NAME: fig:asaplate
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/asadaily.pdf]]

\clearpage

* Population data 

** SM1ST

*** Cumulative 
- Cleaning performed prior to population analysis 
  - There was a loss of capillary voltage after on injection 14 of
    Plate SM1ST2025010007 the remaining samples on that plate were
    removed from the analysis 
  - Plates SM1ST2025010079, SM1ST2025010080, SM1ST2025010082,
    SM1ST2025010084, SM1ST2025010085 where run one or two days after
    punching and have marked elevations in patient and QC
    samples. These have been rejected and will not be included in
    population analysis
  - Plate SM1ST2025010105 there was insufficient IS and was removed from analysis
  - Plates SM1ST2025010258, SM1ST2025010259 and SM1ST2025010260
    removed due elevated results associated with a new batch of
    hydrazine

#+begin_src R :session *R* :results output :exports results :tangle yes
    #asa <- dbGetQuery(conn, "SELECT * from sm1st where test == 'C26:0LPC' and type = 'OBS'" )
    asa_clean <- asa %>%
      filter(plate %nin% c("SM1ST2025010079", "SM1ST2025010080", "SM1ST2025010082",
			   "SM1ST2025010084", "SM1ST2025010085", "SM1ST2025010105",
			   "SM1ST2025010258", "SM1ST2025010259", "SM1ST2025010260",
                            "SM1ST2025010385"))

    Xbar <- mean(asa_clean$result)
    M <- median(asa_clean$result)
    sd <- sd(asa_clean$result)

#+end_src

#+RESULTS:


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  stargazer(data = asa_clean, summary = TRUE, title = "First tier C26:0-LPC summary statistics",
	    label = "tab:asa")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Fri, Sep 19, 2025 - 04:14:50 PM
\begin{table}[!htbp] \centering 
  \caption{First tier C26:0-LPC summary statistics} 
  \label{tab:asa} 
\begin{tabular}{@{\extracolsep{5pt}}lccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
Statistic & \multicolumn{1}{c}{N} & \multicolumn{1}{c}{Mean} & \multicolumn{1}{c}{St. Dev.} & \multicolumn{1}{c}{Min} & \multicolumn{1}{c}{Max} \\ 
\hline \\[-1.8ex] 
result & 23,726 & 7.688 & 5.607 & 0.100 & 100.500 \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  stargazer(quantile(asa_clean$result, probs = c(0.025,0.975)),
	    title = "SM1ST ASA refererence intervals",
	    label = "tab:rifirst",
	    digits = 2,
	    summary = FALSE,
	    rownames = FALSE)
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Fri, Sep 19, 2025 - 04:15:19 PM
\begin{table}[!htbp] \centering 
  \caption{SM1ST ASA refererence intervals} 
  \label{tab:rifirst} 
\begin{tabular}{@{\extracolsep{5pt}} cc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
2.5\% & 97.5\% \\ 
\hline \\[-1.8ex] 
$2.60$ & $22.30$ \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export



 #+begin_src R :session *R* :results graphics file :file ../figures/asa_ny_dens.pdf :exports results :tangle yes

   firsttierpos <- M * 2 # 2 MoM
   secondtierneg <- Xbar * 3.75 # 3.75 MoM
   secondtierpos <- Xbar * 5 # 5 MoM

   dens <- density(asa_clean$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,25), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = firsttierpos , col = "red", lty = 2)
   abline(v = secondtierneg , col = "black" )
   abline(v = secondtierpos , col = "red" )
   ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
   #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
   firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
   borderlinearea <- densarea(dens, lower = secondtierneg, upper = secondtierpos)
   secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("2 MoM: ", round(firsttierpos, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("3.75 * MoX: ", round(secondtierneg, digits = 2), "uM"),
		     paste0(round(borderlinearea*100, digits = 2),"%"),
		     paste0("5 * MoX: ", round(secondtierpos, digits = 2), "uM"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "black", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA, 1, NA),
	  pch = c(15, NA, 15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:Distribution of first-tier C26-LPC with NY screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_ny_dens.pdf]]



 #+begin_src R :session *R* :results graphics file :file ../figures/asa_clean_ny2_dens.pdf :exports results :tangle yes

   threshold1 <- quantile(asa_clean$result, probs = 0.96, type = 8)
   threshold2 <- quantile(asa_clean$result, probs = 0.98, type = 8)

   dens <- density(asa_clean$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,25), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = threshold1 , col = "red", lty = 2)
   abline(v = threshold2 , col = "black" )
   firstarea <- densarea(dens, lower = threshold1, upper = 5)
   borderlinearea <- densarea(dens, lower = threshold1, upper = threshold2)
   secondarea <- densarea(dens, lower = threshold2, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("96%tile: ", round(threshold1, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("98%tile: ", round(threshold2, digits = 2), "uM"),
		     paste0(round(borderlinearea*100, digits = 2),"%"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "black", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA, NA),
	  pch = c(15, NA, 15, NA, 15, 15))

 #+end_src
 #+CAPTION[]:Distribution of first-tier C26-LPC with NY first tier percentile screening approach 
 #+NAME: fig:nypercent
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_clean_ny2_dens.pdf]]




 
  #+begin_src R :session *R* :results graphics file :file ../figures/asa_clean_wi_dens.pdf :exports results :tangle yes

   # WI Sigma approach 
   firsttierpos <- Xbar + 4* sd # X + 4SD
   secondtierpos <- Xbar + 8* sd # X + 8SD

   dens <- density(asa_clean$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,25), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = firsttierpos , col = "red", lty = 2)
   abline(v = secondtierpos , col = "red" )
   ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
   #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
   firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
   secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("Xbar + 4SD: ", round(firsttierpos, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("Xbar + 8SD: ", round(secondtierpos, digits = 2), "uM"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA),
	  pch = c(15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:Distribution of first-tier C26-LPC with WI screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_clean_wi_dens.pdf]]


   #+begin_src R :session *R* :results graphics file :file ../figures/asa_clean_ca_dens.pdf :exports results :tangle yes

     # WI Sigma approach 
     firsttierpos <- 1.3 * Xbar  # 1.3 Xbar
     secondtierpos <- 2.0 * Xbar # 2 Xbar

     dens <- density(asa_clean$result)
     plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,25), main = "")
     polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
     abline(v = firsttierpos , col = "red", lty = 2)
     abline(v = secondtierpos , col = "red" )
     ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
     #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
     firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
     secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

     legend("topright",
	    legend = c("C26:0LPC",
		       paste0("1.3 MoX: ", round(firsttierpos, digits = 2), "uM"),
		       paste0(round(firstarea*100, digits = 2),"%"),
		       paste0("2 MoX: ", round(secondtierpos, digits = 2), "uM"),
		       paste0(round(secondarea*100, digits = 2),"%")),

	    bty = "n",
	    col = c(adjustcolor("blue", alpha.f=0.4),
		    "red", "grey", "red", "grey"),
	    lty = c(NA, 2, NA, 1, NA),
	    pch = c(15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:Distribution of first-tier C26-LPC with CA screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_clean_ca_dens.pdf]]

 \clearpage

*** 30 day

#+begin_src R :session *R* :results output :exports results :tangle yes
  #asa <- dbGetQuery(conn, "SELECT * from sm1st where test == 'C26:0LPC' and type = 'OBS'" )
  asa_d30 <- asa %>%
    filter(date >= d30)

  Xbar <- mean(asa_d30$result)
  M <- median(asa_d30$result)
  sd <- sd(asa_d30$result)

#+end_src

#+RESULTS:


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  stargazer(data = asa_d30, summary = TRUE, title = "30 Day First tier C26:0-LPC summary statistics",
	    label = "tab:asa")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Fri, Sep 19, 2025 - 04:19:21 PM
\begin{table}[!htbp] \centering 
  \caption{30 Day First tier C26:0-LPC summary statistics} 
  \label{tab:asa} 
\begin{tabular}{@{\extracolsep{5pt}}lccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
Statistic & \multicolumn{1}{c}{N} & \multicolumn{1}{c}{Mean} & \multicolumn{1}{c}{St. Dev.} & \multicolumn{1}{c}{Min} & \multicolumn{1}{c}{Max} \\ 
\hline \\[-1.8ex] 
result & 2,599 & 7.093 & 3.566 & 1.400 & 42.600 \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  stargazer(quantile(asa_d30$result, probs = c(0.025,0.975)),
	    title = "30 Day SM1ST C26:0-LPC refererence intervals",
	    label = "tab:rifirst",
	    digits = 2,
	    summary = FALSE,
	    rownames = FALSE)
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Fri, Sep 19, 2025 - 04:19:34 PM
\begin{table}[!htbp] \centering 
  \caption{30 Day SM1ST C26:0-LPC refererence intervals} 
  \label{tab:rifirst} 
\begin{tabular}{@{\extracolsep{5pt}} cc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
2.5\% & 97.5\% \\ 
\hline \\[-1.8ex] 
$3$ & $16.01$ \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export



 #+begin_src R :session *R* :results graphics file :file ../figures/asa_ny_dens.pdf :exports results :tangle yes

   firsttierpos <- M * 2 # 2 MoM
   secondtierneg <- Xbar * 3.75 # 3.75 MoM
   secondtierpos <- Xbar * 5 # 5 MoM

   dens <- density(asa_d30$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,2), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = firsttierpos , col = "red", lty = 2)
   abline(v = secondtierneg , col = "black" )
   abline(v = secondtierpos , col = "red" )
   ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
   #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
   firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
   borderlinearea <- densarea(dens, lower = secondtierneg, upper = secondtierpos)
   secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("2 MoM: ", round(firsttierpos, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("3.75 * MoX: ", round(secondtierneg, digits = 2), "uM"),
		     paste0(round(borderlinearea*100, digits = 2),"%"),
		     paste0("5 * MoX: ", round(secondtierpos, digits = 2), "uM"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "black", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA, 1, NA),
	  pch = c(15, NA, 15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:Distribution of first-tier C26-LPC with NY screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_d30_ny_dens.pdf]]



 #+begin_src R :session *R* :results graphics file :file ../figures/asa_d30_ny2_dens.pdf :exports results :tangle yes

   threshold1 <- quantile(asa_d30$result, probs = 0.96, type = 8)
   threshold2 <- quantile(asa_d30$result, probs = 0.98, type = 8)

   dens <- density(asa_d30$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,2), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = threshold1 , col = "red", lty = 2)
   abline(v = threshold2 , col = "black" )
   firstarea <- densarea(dens, lower = threshold1, upper = 5)
   borderlinearea <- densarea(dens, lower = threshold1, upper = threshold2)
   secondarea <- densarea(dens, lower = threshold2, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("96%tile: ", round(threshold1, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("98%tile: ", round(threshold2, digits = 2), "uM"),
		     paste0(round(borderlinearea*100, digits = 2),"%"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "black", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA, NA),
	  pch = c(15, NA, 15, NA, 15, 15))

 #+end_src
 #+CAPTION[]:30 Day Distribution of first-tier C26-LPC with NY first tier percentile screening approach 
 #+NAME: fig:nypercent
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_d30_ny2_dens.pdf]]




 
  #+begin_src R :session *R* :results graphics file :file ../figures/asa_d30_wi_dens.pdf :exports results :tangle yes

   # WI Sigma approach 
   firsttierpos <- Xbar + 4* sd # X + 4SD
   secondtierpos <- Xbar + 8* sd # X + 8SD

   dens <- density(asa_d30$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,2), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = firsttierpos , col = "red", lty = 2)
   abline(v = secondtierpos , col = "red" )
   ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
   #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
   firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
   secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("Xbar + 4SD: ", round(firsttierpos, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("Xbar + 8SD: ", round(secondtierpos, digits = 2), "uM"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA),
	  pch = c(15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:30 Day Distribution of first-tier C26-LPC with WI screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_d30_wi_dens.pdf]]


   #+begin_src R :session *R* :results graphics file :file ../figures/asa_d30_ca_dens.pdf :exports results :tangle yes

   # WI Sigma approach 
   firsttierpos <- 1.3 * Xbar  # 1.3 Xbar
   secondtierpos <- 2.0 * Xbar # 2 Xbar

   dens <- density(asa_d30$result)
   plot(dens, xlab = "umol/L", col = "grey", xlim = c(0,2), main = "")
   polygon(dens, col=adjustcolor("blue", alpha.f=0.4), border = NA)
   abline(v = firsttierpos , col = "red", lty = 2)
   abline(v = secondtierpos , col = "red" )
   ## with(dens1, polygon(x=c(x[x <= threshold1], threshold1), y=c(y[x <=threshold1], y[x=threshold1] ),col = "darkred", border = "darkred"))
   #with(dens2, polygon(x=c(x[x <= threshold2], threshold2), y=c(y[x <=threshold2], y[x=threshold2] ), col="darkred", border = "darkred"))
   firstarea <- densarea(dens, lower = firsttierpos, upper = 5)
   secondarea <- densarea(dens, lower = secondtierpos, upper = 5)

   legend("topright",
	  legend = c("C26:0LPC",
		     paste0("1.3 MoX: ", round(firsttierpos, digits = 2), "uM"),
		     paste0(round(firstarea*100, digits = 2),"%"),
		     paste0("2 MoX: ", round(secondtierpos, digits = 2), "uM"),
		     paste0(round(secondarea*100, digits = 2),"%")),

	  bty = "n",
	  col = c(adjustcolor("blue", alpha.f=0.4),
		  "red", "grey", "red", "grey"),
	  lty = c(NA, 2, NA, 1, NA),
	  pch = c(15, NA, 15, NA, 15))

 #+end_src
 #+CAPTION[]:30 Day Distribution of first-tier C26-LPC with CA screening approach 
 #+NAME: fig:norm
 #+ATTR_LaTeX: :width 0.9\textwidth
 #+RESULTS:
 [[file:../figures/asa_d30_ca_dens.pdf]]

 \clearpage


* Screening Thresholds

** SM1ST 
- Use the 98p%tile threshold 

#+begin_src R :session *R* :results output graphics file :file ../figures/sm1stts.pdf :exports results :tangle yes
  asa_clean %>%
      group_by(month = floor_date(date, unit = "month")) %>%
      summarise(p98 = round(quantile(result,probs = c(0.98), type = 8, na.rm = TRUE),3)) %>%
      ggplot(aes(x = month)) +
      geom_point(aes(y = p98)) +
      geom_line(aes(y = p98)) +
      scale_x_date(date_labels = "%b-%y") +
      ylab("uM") +
      xlab("date")

#+end_src

#+CAPTION[]:Time series of initial C26:0-LPC 98 percentile by month
#+NAME: fig:
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/sm1stts.pdf]]



#+begin_src R :session *R* :results output latex :exports results :tangle yes
  p96 <- quantile(asa_d30$result, probs = 0.96, type = 8)
  p98 <- quantile(asa_d30$result, probs = 0.98, type = 8)

  asa_d30 %>%
    filter(result >= p98 & date >= d7 ) %>%
    arrange(desc(result)) %>%
    select(date, plate, result) %>%
    ##    select(date, PlateBarcode, Sample, Result) %>%
    as.data.frame() %>%
    stargazer(summary = FALSE, title= paste("Samples with C26:0-LPC concentration >= 98tile:", p98, "uM", sep = " " ))
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Tue, May 27, 2025 - 09:32:39 AM
\begin{table}[!htbp] \centering 
  \caption{Samples with C26:0-LPC concentration >= 98tile: 0.769999980926514 uM} 
  \label{} 
\begin{tabular}{@{\extracolsep{5pt}} cccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
 & date & plate & result \\ 
\hline \\[-1.8ex] 
1 & 2025-05-22 & SM1ST2025010147 & $0.830$ \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export
  

\clearpage


